#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cStartFont.h												*/
/*  @brief		:	スタートの文字クラス										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/08/31													*/
/*																				*/
/*==============================================================================*/

#include "..\..\..\cSpriteObject.h"

//================================================================================================
// スタートの文字クラス
class cStartFont : public cSpriteObject
{
public:
	cStartFont(IBaseObject* parent);
	~cStartFont(void);

	void Initialize(void);
	void Update(void);

private:

	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;
	static const float  MOVE_TIME;
	static const float  FADE_TIME;

	//--------------------------------------------------------------------------------------------

};
//================================================================================================