#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cDeadEffect.h												*/
/*  @brief		:	死亡エフェクトクラス										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/08/26													*/
/*																				*/
/*==============================================================================*/

#include "..\IEffect.h"

//================================================================================================
// 死亡エフェクトクラス
class cDeadEffect : public IEffect
{
public:
	cDeadEffect(IBaseObject* parent);

	// 初期化
	void Initialize(const cVector2& pos) override;
	// 更新
	void Update(void) override;


	// 移動設定
	// angle : degree値の角度  power : 移動力
	void SetMove(float angle, float power);
private:
	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;

	//--------------------------------------------------------------------------------------------
	cVector2 m_vVelocity;		// 移動量

};
//================================================================================================