/*==============================================================================*/
/*																				*/
/*	@file title	:	cBulletManager.cpp											*/
/*  @brief		:	弾管理クラス												*/
/*	@written	:	s.kosugi													*/
/*	@create		:	2020/06/16													*/
/*																				*/
/*==============================================================================*/

#include "cBulletManager.h"
#include "NormalBullet/cNormalBullet.h"
#include "BomLaser/cBomLaser.h"

//==========================================================================================
// 定数
//==========================================================================================


//==========================================================================================
// コンストラクタ
//==========================================================================================
cBulletManager::cBulletManager(IBaseObject* pObj)
	:IBaseObject(pObj, "BulletManager")
{
}
//==========================================================================================
// デストラクタ
//==========================================================================================
cBulletManager::~cBulletManager(void)
{
}

//==========================================================================================
// 初期化
//==========================================================================================
void cBulletManager::Initialize(void)
{
	IBaseObject::Initialize();
}

//==========================================================================================
// 更新
//==========================================================================================
void cBulletManager::Update(void)
{

	IBaseObject::Update();
}
//==========================================================================================
// 破棄
//==========================================================================================
IBaseObject * cBulletManager::Finalize(void)
{
	IBaseObject::Finalize();
	return this;
}

//==========================================================================================
// 弾生成
// return : 生成した弾のポインタ 生成されなかった場合はnullptr
//==========================================================================================
IBullet* cBulletManager::Create(BULLET_ID id,const cVector2& pos, float angle, float speed)
{
	IBullet* pObj = nullptr;
	switch (id)
	{
	case BULLET_ID::NORMAL: pObj = CreateObject<cNormalBullet>(this); break;
	case BULLET_ID::LASER: pObj = CreateObject<cBomLaser>(this); break;
	default:
		break;
	}

	if (pObj)
	{
		pObj->Initialize(pos, angle, speed);
	}

	return pObj;
}