/*==============================================================================*/
/*																				*/
/*	@file title	:	cSensor.cpp													*/
/*  @brief		:	センサークラス												*/
/*	@written	:	s.kosugi													*/
/*	@create		:	2019/07/27													*/
/*																				*/
/*==============================================================================*/

#include "cSensor.h"

//==========================================================================================
// 初期化
//==========================================================================================
void cSensor::Initialize(void)
{
	m_listChildObject.clear();
	m_eObjectState = OBJECT_STATE::ACTIVE;
	m_sObjectName = "Sensor";
	
	IBaseObject::Initialize();
}
