/*==============================================================================*/
/*																				*/
/*	@file title	:	cBomLaser.cpp												*/
/*  @brief		:	レーザー(ボム)クラス										*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/07/20													*/
/*																				*/
/*==============================================================================*/

#include "cBomLaser.h"
#include "Utility/Timer/cTimer.h"

//==========================================================================================
// 定数
//==========================================================================================
const int	cBomLaser::PRIORITY = 300;
const float cBomLaser::HIT_DIST = 52.0f;
//==========================================================================================
// コンストラクタ
//==========================================================================================
cBomLaser::cBomLaser(IBaseObject * parent)
	: IBullet(parent, "LaserBom", "data\\graphic\\laser.png")
{
	SetPriority(PRIORITY);
	m_fDist = HIT_DIST;
	m_bInvincible = true;
	m_bVisible = false;
}

//==========================================================================================
// デストラクタ
//==========================================================================================
cBomLaser::~cBomLaser(void)
{
}

//==========================================================================================
// 更新
//==========================================================================================
void cBomLaser::Update(void)
{
	cTimer* timer = (cTimer*)FindChild("LifeTimer");
	if (!timer)
	{
		timer = CreateObject<cTimer>(this,"LifeTimer");
		timer->Setup(3.0f);
	}
	if (timer->Finished())
	{
		DeleteObject();
	}
	IBullet::Update();
}
