#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cTouchFont.h												*/
/*  @brief		:	タッチの文字クラス											*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/09/14													*/
/*																				*/
/*==============================================================================*/

#include "..\..\..\cSpriteObject.h"

//================================================================================================
// タッチの文字クラス
class cTouchFont : public cSpriteObject
{
public:
	cTouchFont(IBaseObject* parent);
	~cTouchFont(void);

	void Initialize(void) override;
	void Update(void) override;

private:

	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;

	//--------------------------------------------------------------------------------------------

	float m_fSinAngle;		// sin計算で使う角度

};
//================================================================================================