/*==============================================================================*/
/*																				*/
/*	@file title	:	cEffectManager.cpp											*/
/*  @brief		:	エフェクト管理クラス										*/
/*	@written	:	s.kosugi													*/
/*	@create		:	2020/06/22													*/
/*																				*/
/*==============================================================================*/

#include "cEffectManager.h"
#include "BomEffect/cBomEffect.h"
#include "DeadEffect/cDeadEffect.h"
#include "CoinEffect/cCoinEffect.h"

//==========================================================================================
// 定数
//==========================================================================================

//==========================================================================================
// コンストラクタ
//==========================================================================================
cEffectManager::cEffectManager(IBaseObject* pObj)
	:IBaseObject(pObj, "EffectManager")
{
}
//==========================================================================================
// デストラクタ
//==========================================================================================
cEffectManager::~cEffectManager(void)
{
}

//==========================================================================================
// 初期化
//==========================================================================================
void cEffectManager::Initialize(void)
{
	IBaseObject::Initialize();
}

//==========================================================================================
// 更新
//==========================================================================================
void cEffectManager::Update(void)
{
	IBaseObject::Update();
}

//==========================================================================================
// 破棄
//==========================================================================================
IBaseObject * cEffectManager::Finalize(void)
{
	return IBaseObject::Finalize();
}

//==========================================================================================
// 生成
//==========================================================================================
IEffect* cEffectManager::Create(EFFECT_ID id,const cVector2& pos)
{
	IEffect* obj = nullptr;
	switch (id)
	{
	case EFFECT_ID::BOM: obj = CreateObject<cBomEffect>(this); break;
	case EFFECT_ID::DEAD: obj = CreateObject<cDeadEffect>(this); break;
	case EFFECT_ID::COIN: obj = CreateObject<cCoinEffect>(this); break;
	default: break;
	}

	if (obj != nullptr)
	{
		obj->Initialize(pos);
	}
	return obj;
}
