#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cClearFont.h												*/
/*  @brief		:	クリアの文字クラス											*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/08/31													*/
/*																				*/
/*==============================================================================*/

#include "..\..\..\cSpriteObject.h"

//================================================================================================
// クリアの文字クラス
class cClearFont : public cSpriteObject
{
public:
	cClearFont(IBaseObject* parent);
	~cClearFont(void);

	void Initialize(void);
	void Update(void);

private:

	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;
	static const float  MOVE_TIME;
	static const float  FADE_TIME;

	//--------------------------------------------------------------------------------------------

};
//================================================================================================