#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cEnmWhite.h													*/
/*  @brief		:	白い敵クラス												*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/06/16													*/
/*																				*/
/*==============================================================================*/

#include "..\IEnemy.h"

//================================================================================================
// 白い敵クラス
class cEnmWhite : public IEnemy
{
public:
	cEnmWhite(IBaseObject* parent);
	~cEnmWhite(void);

	// 初期化
	void Initialize(const cVector2& pos) override;

	// 更新
	void Update(void) override;

private:
	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;

	// 基本移動力
	static const float	BASE_SPEED;

	// 自転速度
	static const float	ROTATE_SPEED;

	//--------------------------------------------------------------------------------------------

};
//================================================================================================