#pragma once
/*==============================================================================*/
/*																				*/
/*	@file title	:	cStageGoal.h												*/
/*  @brief		:	ゴールオブジェクトクラス									*/
/*	@written	:	s.kosugi													*/
/*	@create		:   2020/08/19													*/
/*																				*/
/*==============================================================================*/

#include "..\IStage.h"

//================================================================================================
// ゴールオブジェクトクラス
class cStageGoal : public IStage
{
public:
	cStageGoal(IBaseObject* parent);
	~cStageGoal(void);

	// 初期化
	void Initialize(const cVector2& pos) override;

	// 更新
	void Update(void) override;
protected:
	// プレイヤー衝突時の処理
	void HitPlayer(void) override;

private:
	//--------------------------------------------------------------------------------------------
	// 定数

	// 表示優先度
	static const int	PRIORITY;

	//--------------------------------------------------------------------------------------------

};
//================================================================================================